
* test
#+begin_src emacs-lisp :results verbatim drawer
(cw--brave-request "emacs" #'browse-url)
#+end_src

#+begin_src emacs-lisp
cw-source-gptel
#+end_src

#+begin_src emacs-lisp
(defun cw-search ()
  (interactive)
  (let ((consult-async-input-throttle 0.7)
        (consult-async-input-debounce 0.4))
    (cw--multi (list cw-source-gptel
                     cw-source-brave)
               :prompt "Search: "
               )))
#+end_src

#+RESULTS:
: cw-search-test

#+begin_src emacs-lisp
(setq consult-web-dynamic-sources '("elfeed" "Brave"))
#+end_src

#+RESULTS:
| elfeed | Brave |

#+begin_src emacs-lisp
(defun consult-web-multi-test ()
  (interactive)
  (let ((consult-async-input-throttle consult-web-dynamic-input-throttle)
        (consult-async-input-debounce consult-web-dynamic-input-debounce))
    (cw--multi (list consult-web--source-gptel)
                     (cdr consult-web--source-brave))
               :prompt "Search: "
               :preview-key "C-o"
               ))
#+end_src
